Autodesk.Revit.DB.PointClouds.PointCloudOverrides.ArePointCloudOverrideSettingsValid(System.String,Autodesk.Revit.DB.PointClouds.PointCloudOverrideSettings)
Checks if PointCloudOverrideSettings are valid
tag:
The tag identifying the particular scan/region within the PointCloudInstance element.
Tags can be obtained from PointCloudInstance via method getScans/getRegions.
settings:
Override settings to be checked.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2014

Autodesk.Revit.DB.PointClouds.PointCloudOverrides.SetPointCloudRegionOverrideSettings(Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.PointClouds.PointCloudOverrideSettings,System.String,Autodesk.Revit.DB.Document)
Assigns override settings to a particular region within a PointCloudInstance element.
elementId:
Id of the element to be overridden.
newSettings:
Override settings to be assigned.
regionTag:
The tag identifying the particular region within the PointCloudInstance element.
Tags can be obtained from PointCloudInstance via method getRegions.
doc:
Document containing the element to be overridden.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Thrown when supplied regionTag is not empty while doc is NULL
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
The override settings are not valid.
Since:
2017

Autodesk.Revit.DB.PointClouds.PointCloudOverrides.SetPointCloudScanOverrideSettings(Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.PointClouds.PointCloudOverrideSettings,System.String,Autodesk.Revit.DB.Document)
Assigns scan override settings to a particular scan within a PointCloudInstance element.
elementId:
Id of the element to be overridden.
newSettings:
Override settings to be assigned.
scanTag:
The tag identifying the particular scan within the PointCloudInstance element.
Tags can be obtained from PointCloudInstance via method getScans.
doc:
Document containing the element to be overridden.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Thrown when supplied scanTag is not empty while doc is NULL
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
The override settings are not valid.
Since:
2017

Autodesk.Revit.DB.PointClouds.PointCloudOverrides.GetPointCloudRegionOverrideSettings(Autodesk.Revit.DB.ElementId,System.String,Autodesk.Revit.DB.Document)
Gets override settings assigned to a particular region within a PointCloudInstance element.
elementId:
Id of the overridden element.
regionTag:
The tag identifying the particular region within the PointCloudInstance element.
Tags can be obtained from PointCloudInstance via method getRegions.
doc:
Document containing the overridden element.
Returns:
The override settings assigned to the region, if present, or a default override settings if nothing was found.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Thrown when supplied regionTag is not empty while doc is NULL
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2017

Autodesk.Revit.DB.PointClouds.PointCloudOverrides.GetPointCloudScanOverrideSettings(Autodesk.Revit.DB.ElementId,System.String,Autodesk.Revit.DB.Document)
Gets override settings assigned to a particular scan within a PointCloudInstance element.
elementId:
Id of the overridden element.
scanTag:
The tag identifying the particular scan within the PointCloudInstance element.
Tags can be obtained from PointCloudInstance via method getScans.
doc:
Document containing the overridden element.
Returns:
The override settings assigned to the scan, if present, or a default override settings if nothing was found.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Thrown when supplied scanTag is not empty while doc is NULL
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2017

Autodesk.Revit.DB.PointClouds.PointCloudOverrides.SetPointCloudRegionOverrideSettings(Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.PointClouds.PointCloudOverrideSettings)
Assigns region override settings to the whole PointCloudInstance element.
elementId:
Id of the element to be overridden.
newSettings:
Override settings to be assigned.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2017

Autodesk.Revit.DB.PointClouds.PointCloudOverrides.SetPointCloudScanOverrideSettings(Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.PointClouds.PointCloudOverrideSettings)
Assigns scan override settings to the whole PointCloudInstance element.
elementId:
Id of the element to be overridden.
newSettings:
Override settings to be assigned.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2017

Autodesk.Revit.DB.PointClouds.PointCloudOverrides.GetPointCloudRegionOverrideSettings(Autodesk.Revit.DB.ElementId)
Gets region override settings assigned to the whole PointCloudInstance element.
elementId:
Id of the overridden element.
Returns:
The override settings assigned to the element, if present, or a default override settings if nothing was found.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2017

Autodesk.Revit.DB.PointClouds.PointCloudOverrides.GetPointCloudScanOverrideSettings(Autodesk.Revit.DB.ElementId)
Gets scan override settings assigned to the whole PointCloudInstance element.
elementId:
Id of the overridden element.
Returns:
The override settings assigned to the element, if present, or a default override settings if nothing was found.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2017

Autodesk.Revit.DB.PointClouds.PointCloudOverrides.Assign(Autodesk.Revit.DB.PointClouds.PointCloudOverrides)
Assigns values of the source overrides to this object.
other:
The source overrides.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2014

Autodesk.Revit.DB.PointClouds.PointCloudOverrides.IsEqual(Autodesk.Revit.DB.PointClouds.PointCloudOverrides)
Check if the contents of two overrides are equal.
other:
The overrides to be compared.
Returns:
True for equal, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2014

Autodesk.Revit.DB.PointClouds.PointCloudOverrides.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.PointClouds.PointCloudOverrides.#ctor
Constructs empty overrides object.
Since:
2014

Autodesk.Revit.DB.PointClouds.PointCloudOverrides
Graphic overrides that are stored by a view to be applied to a PointCloudInstance element, or a scan within the element.
Since:
2014